load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Ramp up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained"
  processor: "./functions.js"
  defaults:
    headers:
      Content-Type: "application/json"
  ensure:
    p95: 200
    maxErrorRate: 5

scenarios:
  - name: "User Flow"
    flow:
      - function: "generateRandomId"
      - post:
          url: "/api/users/register"
          json:
            username: "loaduser{{ randomId }}"
            email: "load{{ randomId }}{{ $loopCount }}@example.com"
            password: "pass123"
          optional: true
          expect:
            statusCode: 201 or 409
      - post:
          url: "/api/users/login"
          json:
            email: "load{{ randomId }}{{ $loopCount }}@example.com"
            password: "pass123"
          capture:
            json: "$.token"
            as: "token"
          optional: true
          expect:
            statusCode: 200
      - post:
          url: "/api/tasks"
          headers:
            Authorization: "{{ token }}"
          json:
            title: "Load Task"
            description: "Test desc"
            dueDate: "2025-12-01"
            priority: "medium"
            status: "pending"
          capture:
            json: "$. _id"
            as: "taskId"
          optional: true
          expect:
            statusCode: 201
      - get:
          url: "/api/tasks"
          headers:
            Authorization: "{{ token }}"
          optional: true
          expect:
            statusCode: 200 or 401
      - get:
          url: "/api/tasks/{{ taskId }}"
          headers:
            Authorization: "{{ token }}"
          optional: true
          expect:
            statusCode: 200 or 404 or 401
      - put:
          url: "/api/tasks/{{ taskId }}"
          headers:
            Authorization: "{{ token }}"
          json:
            status: "completed"
          optional: true
          expect:
            statusCode: 200 or 404 or 401
      - delete:
          url: "/api/tasks/{{ taskId }}"
          headers:
            Authorization: "{{ token }}"
          optional: true
          expect:
            statusCode: 204 or 404 or 401
      - get:
          url: "/api/tasks/overdue"
          headers:
            Authorization: "{{ token }}"
          optional: true
          expect:
            statusCode: 200 or 401